package com.example.game;



import java.util.Random;


public class Dictionary {
    private static int iterator = 0;
    private int right =0;
    private int wrong= 0;
    private  String[][] highWords;//A two-dimensional array of high words
    private  String[][] lowWords;//A two-dimensional array of low Words
    private  String[][] mediumWords;//A two-dimensional array of medium Words
    private String[][] wordsSee = new String[4][2];//Define an array of 4 words
    private String[][] oneWords = new String[1][2];//Define an array of 1 words
    private int endex=Main2Activity.getEndex();//Defining variables whose function is to specify which level the user has selected


    public String[][] level()
    {
        if(endex==0)//If the level is low send me this array
            return lowWords;
        if(endex==1)//If the medium is low send me this array
            return mediumWords;
        if(endex==2)//If the high is low send me this array
            return highWords;
        return  highWords;
    }



    public String [][] getNext() {//Guerilla me 4 words + commentary and puts in the newly defined array
        for( int i=0; i<4; i++) {
            Random random = new Random();
            this.iterator = random.nextInt(level().length);//מגריל במקום ה-lenght
            if(i==0)
            {
                wordsSee[i] = level()[this.iterator];
            }
            int w=i;
            for(int j=0;j<w;j++)
            {
                if( level()[this.iterator]!= wordsSee[j])
                    wordsSee[i] = level()[this.iterator];
                else{
                    i--;
                    break;
            }}
        }
        getOneWords(wordsSee);//When we have finished filling out the array of 4 words, send me the array for the method
        return wordsSee;

    }

    public String[][] getOneWords (String[][] wordsSee)//Choose me one random word from the 4 word array
    {
        Random random = new Random();
        this.iterator = random.nextInt(4);
        oneWords[0] = wordsSee[this.iterator];
        return oneWords;

    }


    public String[][] getOneWords()//Methods of get and set
    {
        return oneWords;
    }

    public int getRight()
    {
        return right;
    }

    public int getWrong()
    {
        return wrong;
    }

    public void setWrong(int wrong) {
        this.wrong = wrong;
    }
    public void setRight(int right) {
        this.right = right;
    }


    public Dictionary() {//Inserting words into arrays
        this.highWords = new String[][]{
                {"אבחה", "תנופה, טבח וחורבן"},
                {"אבטיפוס", "מקור"},
                {"אבק אדם", "אדם נטול ערך"},
                {"אגליטרי", "שוויוני"},
                {"אגרונום", "מומחה בתחום החקלאות"},
                {"אד הוק", "ייעודי, במיוחד לשם תכלית מסוימת"},
                {"אדווה", "גל קטן"},
                {"אובליגטורי","מחייב"},
                {"אוד","גזיר עץ בוער שלא נשרף כולו"},
                {"אוד מוצל מאש","שריד, פליט"},
                {"אוד עשן","כינוי לאדם תשוש"},
                {"אוונגרדי","חדשני"},
                {"אוטודידקט","לומד בעצמו"},
                {"אוטוקרט","שליט יחיד, טירן, דספוט, דיקטטור"},
                {"אומניפוטנט","כל-יכול"},
                {"אונגרד","חלוץ, חדשני"},
                {"אונקיה","מידת משקל קטנה"},
                {"אופורטוניזם","סתגלנות, פשרנות אידיאולוגית"},
                {"אופורטוניסט","מנצל הזדמנויות"},
                {"אורחה","שיירה"},
                {"אורקל","מגיד עתידות"},
                {"אזוטרי","ידוע למעטים, סודי"},
                {"אטרופיה","התנוונות"},
                {"אידרה","עצם של דג"},
                {"אינפנטילי","ילדותי"},
                {"אינקוגניטו","בעילום שם, אנונימי, אלמוני"},
                {"אלמנך","לוח המציג את עונות השנה"},
                {"אספלנית","פלסטר, תחבושת"},
                {"בונה פידה","באמת ובתמים, בתום לב"},
                {"בורסקאי","מעבד עורות"},
                {"בזיך","ספל, קערית"},
                {"בטאון","עיתון או כתב-עת"},
                {"ביזארי","מוזר, חריג, יוצא דופן"},
                {"ביזור","פיזור סמכויות "},
                {"בית נכות","מוזיאון"},
                {"בלטריסטיקה","ספרות יפה"},
                {" בקק","החריב"},
                {"גילופין","שכרות קלה"},
                {"גימא ארץ","דהר מהר"},
                {"גלוסקמה","ארון קבורה"},
                {"גסטרונומיה","אמנות הבישול"},
                {" גרוטסקי","מגוחך, נלעג"},
                {" דדוקציה","הסקה מהכלל אל הפרט"},
                {"דוגמטי","דבר מוסכם שאין לערער עליו"},
                {"דופליקט","העתק"},
                {"דוקומנטרי","תיעודי"},
                {"דטרמיניזם","אמונה שהכל נקבע מראש ללא אפשרות שינוי"},
                {"דיאגנוסטי","מאבחן"},
                {"דיאלקטי","וכחני, המשקף ניגודים"},
                {"דיכוטומיה","התפצלות, חלוקה לשניים"},
                {"דילטאנט","בעל ידיעות שטחיות, הדיוט"},
                {"דיסוננס","חוסר התאמה"},
                {"דפתר","פנקס, מחברת, קונטרס"},
                {"הגמוניה","שליטה, שלטון עליון"},
                {"הדוניזם","רדיפת תענוגות, נהנתנות"},
                {"הידוס","הליכה מתנודדת ולא יציבה"},
                {"היפוקרטיזם","צביעות"},
                {"הירואי","שיש בו אומץ וגבורה"},
                {"הלך הזרזיר אצל העורב","כל אחד מתחבר לדומים לו"},
                {"הסתאב","הזדהם, התנוון, הושחת"},
                {"וולגרי","המוני, גס"},
                {"וירטואוז","אמן בעל שליטה מופלאה"},
                {"ורבאלי","מילולי"},
                {"זבן","מוכר"},
                {"זפיר","רוח קלה"},
                {"חאן","אכסניה, מלון אורחים, פונדק"},
                {"חביצה","פודינג"},
                {"חווק","שלב בסולם"},
                {"חוצן","שולי הבגד"},
                {"חטוטרת","גיבנת, גבנון"},
                {"חישן","הססן, חששן, רהוי, מוג לב"},
                {"חמת","שק עור לנוזלים, נאד"},
                {"טבעת פוליקרטס","דבר בלתי הפיך"},
                {"טוגה","גלימה, חלוק אותו לבשו בעבר"},
                {"טנא","סל קלוע מענפים"},
                {"טרנסצדנטלי","מה שנמצא מעבר להכרה"},
                {"יורידי","משפטי"},
                {"ישב על האובניים","עסק וטיפל בדבר"},
                {"כאסקופה נדרסת","רכרוכי"},
                {"כפיס","גזר עץ"},
                {"כרכשת","מעי"},
                {"לבילי","בלתי יציב"},
                {"לבירינת","מבוך"},
                {"לטיפונדיה","אחוזה"},
                {"לטנטי","חבוי, סמוי, כמוס, צפון, גנוז"},
                {"מאניה","שיגעון"},
                {"מוניציפלי","עירוני"},
                {"נישום","מי שאומדים את הכנסתו לצורך מס"},
                {"נרקסיזם","התאהבות האדם בעצמו"},
                {"סאטירה","יצירה ביקורתית ועוקצנית"},
                {"סטגנציה","קיפאון"},
                {"עסיס","מיץ פירות, תירוש, נקטר"},
                {"פובליציסטי","עיתונאי"},
                {"פיאסקוס","כשלון"},
                {"צייקן","קמצן"},
                {"קוביוסטוס","מהמר"},
                {"קומפוזיטור","מלחין"},
                {"קומפליקציה","סיבוך"},
                {"קונקרטי","ממשי, מוחשי, ריאלי"},
                {"רבותא","דבר שיש בו חידוש, יתרון"},
                {"רפרזנטטיבי","ייצוגי"},
                {"שחון","חם ויבש"},
                {"תרבית","מושבה של חיידקים שגודלו מלאכותית"},
                {"תרווד","כף לבחישה"},
        };
        this.lowWords= new String[][]  {
                {"אבדון", "חורבן, כליה, כליון, הרס גמור"},
                {"אדנות", "שלטון, שררה, עצר, מרות"},
                {"אובייקט", "עצם"},
                {"אורחו וריבעו", "דרך חייו, מנהגיו"},
                {"אות קיןן", "בושה שאין למחותה, אות קלו"},
                {"אזניו כרויות", "אוזניו פתוחות, הוא מקשיב היטב"},
                {"אין מנוס", "אין ברירה"},
                {"אלגוריה", "משל"},
                {"אלטרנטיבי", "חלופי"},
                {"אפיקורוס", "כופר בדת,אתיאיסט"},
                {"אתנחתא", "הפסקה"},
                {"בא בימים", "זקן, קשיש"},
                {"בחטף", "במהירות יתרה, בחיפזון, לפתע"},
                {"במצח נחושה", "בעקשנות,בחוצפה"},
                {"בן תשחורת", "צעיר, עול ימים"},
                {"גבה לבו", "התגאה, התייהר, התרברב"},
                {"גוויל", "קלף, דף מספר עתיק"},
                {"גלובלי", "כלל עולמי, אוניברסלי"},
                {"דו פרצופי", " צבוע, חסר כנות"},
                {"דמדומים", "זמן השקיעה או הזריחה"},
                {"דרך ארץ", "נימוסים, התנהגות נאותה"},
                {"האנשה", "ייחוס תכונות אנושיות לבעלי חיים"},
                {"החיש פעמיו", "הזדרז"},
                {"הטמין", "החביא, הסתיר, הכמין, הצפין"},
                {"העז פנים", "התחצף"},
                {"התפלמס", "התווכח, התנצח, התלהם"},
                {"ולד", "תינוק, עולל, ינוקא, זאטוט"},
                {"זאב בעור כבש", "צבוע, מתחסד"},
                {"זדון", "רשעות, מזימה, צדייה"},
                {"זרזיף", "זרם, שטף, קילוח"},
                {"חוטם", "אף"},
                {"חוסן", "כוח, עוז, גבורה, און"},
                {"חופף", "שווה בדיוק לאחר, זהה לגמרי"},
                {"טפל", "לא העיקר"},
                {"טרגי", "עצוב, נוגה, מלא ייסורים"},
                {"יד ימינו", "עוזרו הנאמן, עושה דברו"},
                {"יפוי כוח", "הרשאה, זכות לעשות דבר- מה בשמו של אחר"},
                {"ישר את ההדורים", "ישב את המחלוקת"},
                {"כאוס", "אי סדר, ערבוביה, תוהו ובוהו"},
                {"כיליון עיניים", "קוצר רוח"},
                {"כריזמה", "קסם אישי, כושר מנהיגות"},
                {"לא דובים ולא יער", "לא היו דברים מעולם"},
                {"לפדות", "להחזיר, להשיב"},
                {"מהימן", "אמין"},
                {"מהיר חימה", "עצבני, נוטה להתרגז במהירות"},
                {"מפאת", "מפני, משום, בגלל"},
                {"נא", "מבושל למחצה"},
                {"נקפו ליבו", "התחרט, חש ייסורי מצפון"},
                {"סולד", "נרתע"},
                {"סטטוס", "מצב, עמדה, מעמד"},
                {"עדנה", "רכות"},
                {"עמימות", "אי בהירות"},
                {"עקב אכילס", "נקודת תורפה, בטן רכה"},
                {"פוגרום", "פרעות, מעשי רצח נגד קבוצה"},
                {"פוחלץ", "עור של בעל חיים ממולא בחומר"},
                {"פיזז", "רקד, כירכר"},
                {"צוהר", "חלון, אשנב, חרך"},
                {"צחור", "לבן"},
                {"קברניט", " מפקד אוניה או מטוס, מנהיג, פרנס, נגיד, נשיא"},
                {"קהה ", "לא חד, מטושטש, מעורפל"},
                {"רובד", "שכבה, נדבך, סובסטרט"},
                {"רעלה", "צעיף לכיסוי הפנים"},
                {"שגגה", "טעות"},
                {"שרעפים", "מחשבות, הרהורים, עשתונות"},
                {"תאב", "רוצה, משתוקק, כמה, מתאווה"},
                {"תפל", "חסר טעם"},
                {"תרתי משמע", "שני מובנים לדבר"},

        };
        this.mediumWords= new String[][]{
                {"אבוס", "כלי לנתינת אוכל לבהמות"},
                {"אדנות", "שלטון, שררה, עצר, מרות."},
                {"אובייקטיבי", "ענייני, חסר העדפה אישית."},
                {"אותנטי", "אמיתי, מקורי, לא מזויף"},
                {"אחוז תזזית", "משוגע"},
                {"אין לו דמים", "יקר ערך"},
                {"איש שם", "מפורסם"},
                {"אספקלריה", "ראי"},
                {"אקסיומה", "הנחה שאין עליה ערעור"},
                {"בגרון נטוי", "ביהירות"},
                {"בדמי ימיו", "באמצע חייו"},
                {"בולמוס", "רעב חזק, תאווה"},
                {"בחל", "נגעל, תיעב, קץ, היה לו לזרא"},
                {"ביכר", "העדיף"},
                {"בלשון סגי נהור", "– שימוש משמעות הפוכה"},
                {"בעור שיניו", "נמלט ברגע האחרון"},
                {"בר מינן", "מת, הלך בדרך כל הארץ"},
                {"בשופי", "בנחת, בניחותא, מעדנות"},
                {"גזוזטרה", "מרפסת"},
                {"גלד", "קרום יבש, המכסה את מקום הפציעה בעור"},
                {"גמלוני", "גבוה, ארוך, תמיר, רם"},
                {"דברי חלקות", "חנופה"},
                {"דברי קילוסין", "מחמאות, תשבחות"},
                {"דה פקטו", "למעשה, בפועל בדיעבד"},
                {"דיוטה", "קומה בבניין"},
                {"דרך כוכבו", "הצליח"},
                {"הגיגים", "הרהורים, מחשבות"},
                {"החזיק טובה לעצמו", "התייהר"},
                {"היה כמרקחה", "מהומה"},
                {"המתיק סוד", "טיכס עצה, תחבל תחבולה"},
                {"התחוור", "התברר"},
                {"ונדליזם", "ברבריות, פראות"},
                {"זינוק מטאורי", "קפיצה אדירה קדימה"},
                {"זמורה", "ענף גפן"},
                {"זריה לרוח", "מעשה לא יעיל"},
                {"חדל אישים", "לא יוצלח"},
                {"חיבוטי קבר", "סבל רב, ייסורים"},
                {"חלט", "יצק מים רותחים, שלק, שפת"},
                {"חרב דמוקלס", "סכנה גדולה ומאיימת"},
                {"חתול בשק", "משהו שטיבו אינו ברור"},
                {"טאבו", "לשכת רישום מקרקעין"},
                {"טוטפות", "תפילין"},
                {"טרזני", "גנדרני, קוקטי"},
                {"טרנספורמציה", "שינוי צורה"},
                {"יומרנות", "התפארות ביכולות גדולות מכפי שיש באמת, התיימרות"},
                {"יושב קרנות", "בטלן, יושב בחיבוק ידיים"},
                {"ימי חלדו", "ימי חייו"},
                {"יצא מעורו", "התאמץ לעשות מעשה חיובי"},
                {"ישב על האובניים", "עסק וטיפל בדבר"},
                {"ישימון", "מדבר, שממה, ציה"},
                {"כרה", "ארוחה, סעודה, טוזיג"},
                {"לא נס ליחו", "עדיין כוחו במותניו"},
                {"לבלר", "פקיד, מזכיר, טפסר"},
                {"לגיון", "יחידה צבאית גדולה"},
                {" להוותו", "לצערו, לדאבונו, לרוע מזלו"},
                {"ליברה", "יחידת משקל, ליטרה"},
                {"מאוויים", "רצונות, חשקים, כיסופים, ערגה"},
                {"מגלומניה", "שיגעון גדלות"},
                {"מונופול", "שליטה בלעדית בתחום כלשהו, ללא מתחרים"},
                {"מלנכוליה", "דיכאון, דכדוך, מרה שחורה"},
                {" נבוב", "חלול, ריק מתוכן, שדוף"},
                {"נדבך", "שורת לבנים בבניין, שכבה, רובד, סובסטרט"},
                {"נוטריקון", "כתיבה בראשי תיבות"},
                {"ניואנס", "גוון, הבדל דק"},
                {" סולידריות", "הזדהות, שותפות לרגשות האחר"},
                {"ספקולציה", "השערה"},
                {"ספקטרום", "מגוון האפשרויות"},
                {"סתם את הגולל", "סגר באופן סופי"},
                {"עוקר הרים", "אדם חכם וחריף"},
                {"עידן ועידנים", "זמן רב"},
                {"עשה שמות", "הרס, החריב, חרג מהכללים באופן קיצוני"},
                {" פאתוס", "התפעלות והתרגשות מופרזות"},
                {"פוזיציה", "עמדה"},
                {" פיקטיבי", "לא אמיתי, מדומה, בדוי"},
                {" צוארון כחול", "שכבה חברתית העוסקת בעבודות כפיים"},
                {"צילינדר", "מגבעת גבוהה"},
                {" צניפה", "צהלת הסוס"},
                {"צפריר", "רוח בוקר נעימה"},
                {"קו פרשת המים", "נקודת זמן שממנה לא ניתן לחזור"},
                {" קובלנה", "תלונה, טענה, מענה, תרעומת"},
                {"ריחיים בצווארו", "נתון תחת עול"},
                {"שאט", "בוז, תיעוב, סלידה"},
                {"שוביניזם", "התנגדות לשוויון זכויות לנשים"},
                {"שפרה", "יופי, חן"},
                {"תהום הנשיה", "שכחה מוחלטת"},
                {"תמוכה", "משענת, סמוכה"},
        };
    }

    public boolean report(String click) {//Check if the word the user clicked is the same as the word saved in the oneWord array

        if (!click.toLowerCase().equals(oneWords[0][1])) {
            int i=this.getWrong();
            this.setWrong(i+1);//If so you will add a mistake / victory to the score

            return false;
        }
        else {
            int w = this.getRight();
            this.setRight(w+1);
            return true;
        }

    }
}




